Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4CMP8C_1.xml
          </instance>
        </module>
        <module name="FUSES" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt index="-14" name="NonMaskableInt_IRQn" caption="Non Maskable Interrupt"/>
        <interrupt index="-12" name="MemoryManagement_IRQn" caption="Cortex-M4 Memory Management Interrupt"/>
        <interrupt index="-11" name="BusFault_IRQn" caption="Cortex-M4 Bus Fault Interrupt"/>
        <interrupt index="-10" name="UsageFault_IRQn" caption="Cortex-M4 Usage Fault Interrupt"/>
        <interrupt index="-5" name="SVCall_IRQn" caption="Cortex-M4 SV Call Interrupt"/>
        <interrupt index="-4" name="DebugMonitor_IRQn" caption="Cortex-M4 Debug Monitor Interrupt"/>
        <interrupt index="-2" name="PendSV_IRQn" caption="Cortex-M4 Pend SV Interrupt"/>
        <interrupt index="-1" name="SysTick_IRQn" caption="Cortex-M4 System Tick Interrupt"/>
        <interrupt index="0" module-instance="SYSC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="SYSC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="SYSC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="SYSC" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="SYSC" name="WDT" caption="Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC" name="EFC" caption="Enhanced Embedded Flash Controller"/>
        <interrupt index="8" module-instance="UART0" name="UART0" caption="UART 0"/>
        <interrupt index="11" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A"/>
        <interrupt index="12" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="14" module-instance="USART0" name="USART0" caption="USART 0"/>
        <interrupt index="15" module-instance="USART1" name="USART1" caption="USART 1"/>
        <interrupt index="16" module-instance="USART2" name="USART2" caption="USART 2"/>
        <interrupt index="17" module-instance="USART3" name="USART3" caption="USART 3"/>
        <interrupt index="19" module-instance="TWI0" name="TWI0" caption="Two Wire Interface 0"/>
        <interrupt index="20" module-instance="TWI1" name="TWI1" caption="Two Wire Interface 1"/>
        <interrupt index="21" module-instance="SPI0" name="SPI0" caption="Serial Peripheral Interface 0"/>
        <interrupt index="23" module-instance="TC0" name="TC0" caption="Timer/Counter 0"/>
        <interrupt index="24" module-instance="TC0" name="TC1" caption="Timer/Counter 1"/>
        <interrupt index="25" module-instance="TC0" name="TC2" caption="Timer/Counter 2"/>
        <interrupt index="26" module-instance="TC1" name="TC3" caption="Timer/Counter 3"/>
        <interrupt index="27" module-instance="TC1" name="TC4" caption="Timer/Counter 4"/>
        <interrupt index="28" module-instance="TC1" name="TC5" caption="Timer/Counter 5"/>
        <interrupt index="29" module-instance="ADC" name="ADC" caption="Analog To Digital Converter"/>
        <interrupt index="31" module-instance="IPC0" name="IPC0" caption="Interprocessor communication 0"/>
        <interrupt index="32" module-instance="SLCDC" name="SLCDC" caption="Segment LCD Controller"/>
        <interrupt index="33" module-instance="TRNG" name="TRNG" caption="True Random Generator"/>
        <interrupt index="34" module-instance="ICM" name="ICM" caption="Integrity Check Module"/>
        <interrupt index="36" module-instance="AES" name="AES" caption="Advanced Enhanced Standard"/>
        <interrupt index="37" module-instance="PIOC" name="PIOC" caption="Parallel I/O Controller C"/>
        <interrupt index="38" module-instance="UART1" name="UART1" caption="UART 1"/>
        <interrupt index="39" module-instance="IPC1" name="IPC1" caption="Interprocessor communication 1"/>
        <interrupt index="40" module-instance="SPI1" name="SPI1" caption="Serial Peripheral interface 1"/>
        <interrupt index="41" module-instance="PWM" name="PWM" caption="Pulse Width Modulation"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B3403F"/>
          <property name="CHIPID_CIDR" value="0xA64C0AE0"/>
          <property name="CHIPID_EXID" value="0x1"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM4_REV" value="0x0000"/>
        <param name="__MPU_PRESENT" value="0"/>
        <param name="__FPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
    </device>
  </devices>
  <modules>
    <module caption="Analog-to-Digital Converter" name="ADC" version="11250A">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES" values="ADC_MR__LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="User Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
        <register caption="Channel Sequence 1 Register" name="ADC_SEQR1" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Sequence Number 1" mask="0x0000000F" name="USCH1"/>
          <bitfield caption="User Sequence Number 2" mask="0x000000F0" name="USCH2"/>
          <bitfield caption="User Sequence Number 3" mask="0x00000F00" name="USCH3"/>
          <bitfield caption="User Sequence Number 4" mask="0x0000F000" name="USCH4"/>
          <bitfield caption="User Sequence Number 5" mask="0x000F0000" name="USCH5"/>
          <bitfield caption="User Sequence Number 6" mask="0x00F00000" name="USCH6"/>
        </register>
